# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [3]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [8]:
df = df.loc[:,"Name":]
df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [9]:
df.value_counts('Gender')

Gender
F    558846
M    457549
dtype: int64

### Step 7. Group the dataset by name and assign to names

In [17]:
names = df.groupby(by='Name').sum()
names.sort_values('Count', ascending=False)

               Year   Count
Name
Jacob       1141099  242874
Emma        1137085  214852
Michael     1161152  214405
Ethan       1139091  209277
Isabella    1137090  204798
...             ...     ...
Eniola         2012       5
Atlantis       2005       5
Marci          2004       5
Simarpreet     2011       5
Nita           2007       5

[17632 rows x 2 columns]

### Step 8. How many different names exist in the dataset?

In [18]:
df.nunique()

Name      17632
Year         11
Gender        2
State        51
Count      1949
dtype: int64

### Step 9. What is the name with most occurrences?

In [21]:
names['Count'].idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [25]:
min=names['Count'].min()
names[names['Count'] == min]

          Year  Count
Name
Aadarsh   2009      5
Aadin     2008      5
Aaima     2013      5
Aalaya    2014      5
Aaminah   2004      5
...        ...    ...
Zyien     2009      5
Zyire     2007      5
Zykeriah  2008      5
Zykierra  2007      5
Zymari    2009      5

[2578 rows x 2 columns]

### Step 11. What is the median name occurrence?

In [26]:
names['Count'].median()

49.0

### Step 12. What is the standard deviation of names?

In [27]:
names['Count'].std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [28]:
df.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03